title: DMP File Creation In Unusual Folder
description: Detects .dmp file creation in unusual folder, relative to different memory dumping tools to create a memory dump of the LSASS process memory, which contains user credentials.
author: nhilnt
tags:
  - attack.t1003.001
  - attack.credential_access
date: 2024/12/21
status: test
reference:
  - https://detection.fyi/sigmahq/sigma/windows/file/file_event/file_event_win_lsass_default_dump_file_names/
  - https://help.fortinet.com/fsiem/Public_Resource_Access/7_1_1/rules/PH_RULE_LSASS_Process_Memory_Dump_Files.htm
logsource:
  category: file_event
  product: windows
  service: sysmon
detection:
  selection:
    TargetFilename|endswith: '.dmp'
    TargetFilename|contains:
      - '\Users\Public\'
      - '\Appdata\Local\Temp\'
      - '\Windows\Temp\'
  condition: selection
falsepositives:
  - unknown
level: low