title: Suspicious File Download Via Powershell
status: test
description: Malware Download via Command Line
author: nhilnt
date: 2024/12/21
logsource:
    product: windows
    category: process_creation
detection:
    selection:
        CommandLine|contains:
            - 'DownloadFile'
    condition: selection
falsepositives:
    - Unknown
level: medium