title: Timestomping using Powershell
description: Detects modifying file time attributes to hide new or changes to existing files. Timestomping is a technique that modifies the timestamps of a file (the modify, access, create, and change times), often to mimic files that are in the same folder.
author: nhilnt
tags:
  - attack.t1070.006
  - attack.defense_evasion
date: 2024/12/28
status: test
reference:
  - https://detection.fyi/sigmahq/sigma/windows/powershell/powershell_script/posh_ps_timestomp/
logsource:
  category: ps_script
  product: windows
  service: powershell
  definition: Script Block Logging must be enabled
detection:
  selection:
    ScriptBlockText|contains:
      - '.creationtime' 
      - '.lastwritetime' 
      - '.lastaccesstime' 
      - 'creationtime-value'
      - 'lastwritetime-value'
      - 'lastaccesstime-value'
      - 'io.file]::setcreationtime'
      - 'io.file]::setlastaccesstime'
      - 'io.file]::setlastwritetime'
  condition: selection
falsepositives:
  - unknown
level: medium
