title: Mimikatz Detection LSASS Access
status: test
description: Detects process access to LSASS which is typical for Mimikatz
author: nhilnt
date: 2024/12/18
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1003.001
tags:
    - attack.t1003
    - attack.s0002
    - attack.credential_access
logsource:
    product: windows
    service: sysmon
detection:
    selection:
        EventID: 10
        TargetImage: 'C:\windows\system32\lsass.exe'
    condition: selection
fields:
    - EventCode
    - TargetImage
    - GrantedAccess
    - ComputerName
falsepositives:
    - unknown
level: high