title: Suspicious Microsoft Office Child Process 
description: Detects a suspicious process spawning from one of the Microsoft Office suite products (Word, Excel, PowerPoint, Publisher, Visio, etc.) 
author: nhilnt 
tags: 
  - attack.t1204.002 
  - attack.execution 
date: 2024/12/18
status: test 
reference: 
  - https://www.elastic.co/guide/en/security/current/suspicious-ms-office-child-process.html 
logsource: 
  category: process_creation 
  product: windows 
  service: sysmon 
detection: 
  selection_spp: 
    ParentImage|endswith: 
      - '\eqnedt32.exe' 
      - '\excel.exe' 
      - '\fltldr.exe' 
      - '\msaccess.exe' 
      - '\mspub.exe' 
      - '\powerpnt.exe' 
      - '\winword.exe' 
      - '\outlook.exe' 
      - '\visio.exe' 
      - '\onenote.exe' 
      - '\wordpad.exe' 
      - '\wordview.exe' 
  selection_tpp: 
    - OriginalFileName: 
      - 'bitsadmin.exe' 
      - 'CertOC.exe' 
      - 'CertUtil.exe' 
      - 'Cmd.Exe' 
      - 'CMSTP.EXE' 
      - 'cscript.exe' 
      - 'curl.exe' 
      - 'HH.exe' 
      - 'IEExec.exe' 
      - 'InstallUtil.exe' 
      - 'javaw.exe' 
      - 'Microsoft.Workflow.Compiler.exe' 
      - 'msdt.exe' 
      - 'MSHTA.EXE' 
      - 'msiexec.exe' 
      - 'Msxsl.exe' 
      - 'odbcconf.exe' 
      - 'pcalua.exe' 
      - 'PowerShell.EXE' 
      - 'RegAsm.exe' 
      - 'RegSvcs.exe' 
      - 'REGSVR32.exe' 
      - 'RUNDLL32.exe' 
      - 'schtasks.exe' 
      - 'ScriptRunner.exe' 
      - 'wmic.exe' 
      - 'WorkFolders.exe' 
      - 'wscript.exe' 
      - 'arp.exe' 
      - 'ATBroker.exe' 
      - 'ftp.exe' 
      - 'gprslt.exe' 
      - 'hostname.exe' 
      - 'IEXPRESS.EXE' 
      - 'ipconfig.exe' 
      - 'net.exe' 
      - 'net1.exe' 
      - 'netsh.exe' 
      - 'netstat.exe' 
      - 'nltestrk.exe' 
      - 'ping.exe' 
      - 'reg.exe' 
      - 'sc.exe' 
      - 'sysinfo.exe' 
      - 'tasklist.exe' 
      - 'tracert.exe' 
      - 'whoami.exe' 
      - 'xwizard.exe' 
    - Image|contains: 
      - '\appdata\' 
      - '\users\public\' 
      - '\programdata\' 
      - '\windows\tasks\' 
      - '\windows\temp\' 
      - '\windows\sytem32\task' 
    - Image|endswith: 
      - '\appvlp.exe' 
      - '\bash.exe' 
      - '\bitsadmin.exe' 
      - '\certoc.exe' 
      - '\certutil.exe' 
      - '\cmd.exe' 
      - '\cmstp.exe' 
      - '\control.exe' 
      - '\cscript.exe' 
      - '\curl.exe' 
      - '\forfiles.exe' 
      - '\hh.exe' 
      - '\ieexec.exe' 
      - '\installutil.exe' 
      - '\javaw.exe' 
      - '\mftrace.exe' 
      - '\microsoft.workflow.compiler.exe' 
      - '\msbuild.exe' 
      - '\msdt.exe' 
      - '\mshta.exe' 
      - '\msidb.exe' 
      - '\msiexec.exe' 
      - '\msxsl.exe' 
      - '\odbcconf.exe' 
      - '\pcalua.exe' 
      - '\powershell.exe' 
      - '\pwsh.exe' 
      - '\regasm.exe' 
      - '\regsvcs.exe' 
      - '\regsvr32.exe' 
      - '\rundll32.exe' 
      - '\schtasks.exe' 
      - '\scrcons.exe' 
      - '\scriptrunner.exe' 
      - '\sh.exe' 
      - '\svchost.exe' 
      - '\verclsid.exe' 
      - '\wmic.exe' 
      - '\workfolders.exe' 
      - '\wscript.exe' 
      - '\arp.exe' 
      - '\atbroker.exe' 
      - '\bginfo.exe' 
      - '\cdb.exe' 
      - '\csi.exe' 
      - '\dnx.exe' 
      - '\dsget.exe' 
      - '\dsquery.exe' 
      - '\fsi.exe' 
      - '\ftp.exe' 
      - '\gpresult.exe' 
      - '\hostname.exe' 
      - '\iexpress.exe' 
      - '\ipconfig.exe' 
      - '\nbtstat.exe' 
      - '\net.exe' 
      - '\net1.exe' 
      - '\netsh.exe' 
      - '\netstat.exe' 
      - '\nltest.exe' 
      - '\ping.exe' 
      - '\qprocess.exe' 
      - '\quser.exe' 
      - '\qwinsta.exe' 
      - '\rcsi.exe' 
      - '\reg.exe' 
      - '\sc.exe' 
      - '\systeminfo.exe' 
      - '\tasklist.exe' 
      - '\tracert.exe' 
      - '\whoami.exe' 
      - '\xwizard.exe' 
  condition: selection_spp and selection_tpp 
falsepositives: 
  - none 
level: medium