title: Archives Data via Powershell in Windows
status: test
description: Use living off the land tools to zip a file and stage it in the Windows temporary folder for later exfiltration
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1074.001/T1074.001.md
author: nhilnt
date: 2024/12/21
tags:
    - attack.collection
    - attack.t1074.001
logsource:
    product: windows
    category: process_creation
detection:
    selection:
        CommandLine|contains|all:
            - 'Compress-Archive '
            - ' -Path '
            - ' -DestinationPath '
    condition: selection
falsepositives:
    - Unknown
level: medium