title: Suspicious Whoami.EXE Execution
status: experimental
description: Detects the execution of "whoami.exe" with the "/all" flag or with redirection options to export the results to a file for later use.
references:
    - https://brica.de/alerts/alert/public/1247926/agent-tesla-keylogger-delivered-inside-a-power-iso-daa-archive/
    - https://app.any.run/tasks/7eaba74e-c1ea-400f-9c17-5e30eee89906/
    - https://www.youtube.com/watch?v=DsJ9ByX84o4&t=6s
author: nhilnt
date: 2024/12/18
tags:
    - attack.discovery
    - attack.t1033
    - car.2016-03-001
logsource:
    category: process_creation
    product: windows
detection:
    selection_main_img:
        - Image|endswith: '\whoami.exe'
        - OriginalFileName: 'whoami.exe'
    selection_main_cli:
        CommandLine|contains:
            - ' -all'
            - ' /all'
            - ' /FO CSV'
            - ' -FO CSV'
    selection_special:
        CommandLine|contains|all:
            - 'whoami'
            - '>'
    condition: all of selection_main_* or selection_special
falsepositives:
    - Unknown
level: high